In [10]:

import csv

f=open("sat.csv")
reader=csv.reader(f)

header=next(reader)
print(header)
dataset=[]

for line in reader:
    d=dict(zip(header,line))
    dataset.append(d)

['DBN', 'School Name', 'Number of Test Takers', 'Critical Reading Mean', 'Mathematics Mean', 'Writing Mean']

In [11]:
import pandas as pd 

df=pd.read_csv("sat.csv",header=0)

In [12]:
df.head()

,DBN,School Name,Number of Test Takers,Critical Reading Mean,Mathematics Mean,Writing Mean
0,01M292,Henry Street School for International Studies,31.0,391.0,425.0,385.0
1,01M448,University Neighborhood High School,60.0,394.0,419.0,387.0
2,01M450,East Side Community High School,69.0,418.0,431.0,402.0
3,01M458,SATELLITE ACADEMY FORSYTH ST,26.0,385.0,370.0,378.0
4,01M509,CMSP HIGH SCHOOL,NaN,NaN,NaN,NaN

df.describe

In [13]:
df

,DBN,School Name,Number of Test Takers,Critical Reading Mean,Mathematics Mean,Writing Mean
0,01M292,Henry Street School for International Studies,31.0,391.0,425.0,385.0
1,01M448,University Neighborhood High School,60.0,394.0,419.0,387.0
2,01M450,East Side Community High School,69.0,418.0,431.0,402.0
3,01M458,SATELLITE ACADEMY FORSYTH ST,26.0,385.0,370.0,378.0
4,01M509,CMSP HIGH SCHOOL,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...
455,75R025,South Richmond High School,10.0,407.0,421.0,400.0
456,75X012,PS12X LEWIS AND CLARK SCHOOL,NaN,NaN,NaN,NaN
457,75X754,P754 X - Jeffrey M. Rapport School for Career ...,NaN,NaN,NaN,NaN
458,76K460,John Jay High School,9.0,390.0,381.0,398.0
459,79X490,PHOENIX SCHOOL,7.0,404.0,423.0,416.0

In [14]:
df.describe()

,Number of Test Takers,Critical Reading Mean,Mathematics Mean,Writing Mean
count,386.000000,386.000000,386.000000,386.000000
mean,103.658031,404.248705,412.935233,397.689119
std,145.264496,56.815631,64.990976,57.762584
min,7.000000,291.000000,281.000000,285.000000
25%,35.000000,370.000000,372.000000,364.000000
50%,54.000000,392.500000,394.500000,383.000000
75%,92.750000,419.000000,429.750000,414.000000
max,1047.000000,674.000000,735.000000,678.000000

In [15]:
null_values=df.isnull()

In [20]:
null_values.head()

,DBN,School Name,Number of Test Takers,Critical Reading Mean,Mathematics Mean,Writing Mean
0,False,False,False,False,False,False
1,False,False,False,False,False,False
2,False,False,False,False,False,False
3,False,False,False,False,False,False
4,False,False,True,True,True,True

In [22]:
df.dtypes

DBN                       object
School Name               object
Number of Test Takers    float64
Critical Reading Mean    float64
Mathematics Mean         float64
Writing Mean             float64
dtype: object

In [28]:
for i in null_values.columns.values.tolist():
    print(i)
    print(null_values[i].value_counts())

DBN
False    460
Name: DBN, dtype: int64
School Name
False    460
Name: School Name, dtype: int64
Number of Test Takers
False    386
True      74
Name: Number of Test Takers, dtype: int64
Critical Reading Mean
False    386
True      74
Name: Critical Reading Mean, dtype: int64
Mathematics Mean
False    386
True      74
Name: Mathematics Mean, dtype: int64
Writing Mean
False    386
True      74
Name: Writing Mean, dtype: int64